Repository: Rafeek-Grd/Rafeek
Catalog: Rafeek.Application/Localization/Messages.*.resx
Languages: ar

# PlaceNotValid
source: Place of file is not valid.
ar: مكان الملف غير صالح.

# PlaceNotSupported
source: Place file Not Supported.
ar: الملف غير مدعوم.

# FilePalceNotValid
source: Place of file is not valid.
ar: مكان الملف غير صالح.

source: File Not Found
ar: الملف غير موجود.

source: File Name Requried
ar: اسم الملف مطلوب.

# FileNotValid
source: File has incorrect extension or does not exist
ar: الملف ليس من الامتداد الصحيح أو غير موجود.

source: File Upload Failed.
ar: فشل رفع الملف.

# FaildToDeleted
source: File Deletion Failed.
ar: فشل إزالة الملف.

# OkActionResultMessage
source: Operation successfully.
ar: تم تنفيذ العملية بنجاح.

# CreatedActionResultMessage
source: Created successfully.
ar: تم الإنشاء بنجاح.

# AcceptedActionResultMessage
source: Request accepted successfully.
ar: تم قبول الطلب بنجاح.

# DeletedActionResultMessage
source: Deleted successfully.
ar: تم الحذف بنجاح.

# ValidationExceptionMessage
source: Validation exception occurred.
ar: حدث استثناء في التحقق.

# InvalidModelStateExceptionMessage
source: Invalid model state.
ar: حالة النموذج غير صالحة.

# NotFoundExceptionMessage
source: The requested resource was not found.
ar: المورد المطلوب غير موجود.

# BadRequestExceptionMessage
source: Bad request.
ar: طلب غير صالح.

# UnauthorizedExceptionMessage
source: Unauthorized access.
ar: دخول غير مصرح به.

# UnknownExceptionMessage
source: An unknown error occurred.
ar: حدث خطأ غير معروف.

# TokenNotValid
source: Invalid Token.
ar: التوكن غير صالح.

# InvalidSignIn
source: Invalid email or password!.
ar: الايميل او كلمة المرور غير صالحة.

# NationalNumberExist
source: National Number is already taken.
ar: الرقم القومي محجوز بالفعل.

# PhoneNumberExist
source: Phone number is already taken.
ar: رقم الهاتف محجوز بالفعل.

# UserCodeExist
source: User Code is already taken.
ar: حقل كلمة السر مطلوب.

# PhoneInvalid
source: Invalid phone number.
ar: رقم الهاتف غير صالح

# EmailInvalid
source: Invalid email.
ar: الايميل غير صالح.

# EmailAlreadyExistedbefore
source: User already exists before.
ar: المستخدم موجود بالفعل

# GenderIsNotValid
source: Invalid gender.
ar: الجنس غير صالح.

source: Password required.
ar: كلمة السر مطلوبة

# PasswordValid
source: Password may be weak. Or it doesn't accepted cause of criteria.
ar: كلمة السر اما ضعيفة أو قد لا تستوفي المعايير المطلوبة.

# PasswordConfirmNotEqual
source: Password confirmation value not equals to password value.
ar: حقل تاكيد كلمة السر لايتطابق مع حقل كلمة السر.

source: Fullname required.
ar: الاسم مطلوب.

# PhoneRequired
source: Phone number required.
ar: رقم الهاتف مطلوب.

source: Email required.
ar: الايميل مطلوب.

source: National number required.
ar: الرقم القومي مطلوب.
